src/cf/InformationRegisters/desОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>desОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/HTTPServices/desПередачаДанных/Ext/Module.bsl
Функция ЗапросPUT(Запрос)
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ID");
	
	//СтрокаЗапросаТело = Запрос.ПолучитьТелоКакСтроку();
	//
	//ЧтениеJS = Новый ЧтениеJSON;
	//	
	//ЧтениеJS.УстановитьСтроку(СтрокаЗапросаТело);
	//	
	//JSЗапросХЗ = СериализаторXDTO.ПрочитатьJSON(ЧтениеJS);
		
	Ответ = Новый HTTPСервисОтвет(200);
	
	Возврат Ответ;
КонецФункции

Функция SendMessagePOST(Запрос)
	
	СтруктураЗапроса =  Новый Структура(); 
	
	IDНастройки 	= Запрос.ПараметрыURL.Получить("ID");
	
	СтруктураЗапроса.Вставить("ИдентификаторНастройки",Новый УникальныйИдентификатор(IDНастройки));
	
	СтруктураЗапроса.Вставить("ИмяОчереди",Запрос.ПараметрыURL.Получить("QueueName"));
	
	// ++ VOG Солодов В.В. 07.10.2021 
	Идентификатор = Запрос.Заголовки.Получить("DocumentID");
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		СтруктураЗапроса.Вставить("Идентификатор", Идентификатор);
	КонецЕсли;
	
	ОтключитьОбработку = Запрос.Заголовки.Получить("DisableRealTimeProcessing");
	
	Если ЗначениеЗаполнено(ОтключитьОбработку) Тогда
		СтруктураЗапроса.Вставить("ОтключитьОбработку", Истина);
	КонецЕсли;
	// -- VOG Солодов В.В. 07.10.2021 
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	Если Не ПустаяСтрока(Тело) Тогда 
		СтруктураЗапроса.Вставить("Сообщение",Тело);
		РегистрыСведений.desОчередьВходящихСообщений.ЗарегистрироватьЗапрос(СтруктураЗапроса);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
